# filtering data

In [1]:
import pandas as pd

In [2]:
data=[["A",40,50,60,30],["B",85,45,79,12],["C",42,15,60,24],
      ["D",25,78,45,62],["E",45,85,24,56],["F",52,48,56,74],
      ["G",56,87,45,58],["H",56,48,89,52],["I",58,45,66,55],
      ["J",56,87,25,45]]

In [3]:
df1=pd.DataFrame(data=data,columns=["Name","Maths","Physics","Chemistry","English"])

In [4]:
df1

  Name  Maths  Physics  Chemistry  English
0    A     40       50         60       30
1    B     85       45         79       12
2    C     42       15         60       24
3    D     25       78         45       62
4    E     45       85         24       56
5    F     52       48         56       74
6    G     56       87         45       58
7    H     56       48         89       52
8    I     58       45         66       55
9    J     56       87         25       45

# filter data with single condition

In [9]:
#filter by Maths column marks less than 50 
#return boolean array
df1["Maths"]<50

0     True
1    False
2     True
3     True
4     True
5    False
6    False
7    False
8    False
9    False
Name: Maths, dtype: bool

In [10]:
#now fetch data it return values those are True

In [12]:
#df1["Maths"]<50
df1[df1["Maths"]<50]

  Name  Maths  Physics  Chemistry  English
0    A     40       50         60       30
2    C     42       15         60       24
3    D     25       78         45       62
4    E     45       85         24       56

In [13]:
df1["English"]<50

0     True
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: English, dtype: bool

In [14]:
df1[df1["English"]<50]

  Name  Maths  Physics  Chemistry  English
0    A     40       50         60       30
1    B     85       45         79       12
2    C     42       15         60       24
9    J     56       87         25       45

In [16]:
df1["English"][df1["English"]<50]

0    30
1    12
2    24
9    45
Name: English, dtype: int64

# Multiple Condition

In [17]:
#maths marks between 50 to 70

In [18]:
df1["Maths"]>50

0    False
1     True
2    False
3    False
4    False
5     True
6     True
7     True
8     True
9     True
Name: Maths, dtype: bool

In [19]:
df1["Maths"]<70

0     True
1    False
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
Name: Maths, dtype: bool

In [27]:
#creates ambiguity so use bracket for each condition
df1["Maths"]>50 & df1["Maths"]<70 #use bitwise and ie & because of boolean array

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [26]:
(df1["Maths"]>50) & (df1["Maths"]<70) #use bitwise and ie & because of boolean array

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
9     True
Name: Maths, dtype: bool

In [30]:
df1[(df1["Maths"]>50) & (df1["Maths"]<70)] #use bitwise and ie & because of boolean array

  Name  Maths  Physics  Chemistry  English
5    F     52       48         56       74
6    G     56       87         45       58
7    H     56       48         89       52
8    I     58       45         66       55
9    J     56       87         25       45

In [31]:
df1[(df1["Maths"]>50) & (df1["Maths"]<70)]["Maths"]

5    52
6    56
7    56
8    58
9    56
Name: Maths, dtype: int64

In [ ]:
#English marks between less than 50 to greater 60

In [33]:
df1["English"]<50

0     True
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: English, dtype: bool

In [34]:
df1["English"]>70

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: English, dtype: bool

In [35]:
(df1["English"]<50)|(df1["English"]>70)#using biwise or as boolean array

0     True
1     True
2     True
3    False
4    False
5     True
6    False
7    False
8    False
9     True
Name: English, dtype: bool

In [36]:
df1[(df1["English"]<50)|(df1["English"]>70)]

  Name  Maths  Physics  Chemistry  English
0    A     40       50         60       30
1    B     85       45         79       12
2    C     42       15         60       24
5    F     52       48         56       74
9    J     56       87         25       45